Repository: alirzaghlmpr/woo-bulk-price-discount-editor
Catalog: languages/bulk-price-discount-editor-*.po
Languages: fa_ir

source: WooCommerce is Required
fa_ir: ووکامرس الزامی است

source: WooCommerce Bulk Price & Discount Editor Pro requires WooCommerce to be installed and activated.
fa_ir: افزونه مدیریت قیمت و تخفیف نیازمند نصب و فعال‌سازی ووکامرس می‌باشد.

source: Bulk Price & Discount Manager (Pro)
fa_ir: ابزار مدیریت قیمت و تخفیف (حرفه‌ای)

source: Preview & Review Changes
fa_ir: بررسی و پیش‌نمایش تغییرات

source: Operation Type
fa_ir: نوع عملیات

source: Increase Regular Price
fa_ir: افزایش قیمت اصلی (Regular Price)

source: Decrease Regular Price
fa_ir: کاهش قیمت اصلی (Regular Price)

source: Apply/Update Sale Price
fa_ir: اعمال/بروزرسانی قیمت حراج (Sale Price)

source: Remove All Discounts
fa_ir: حذف کامل تخفیف‌ها

source: Change Amount
fa_ir: مقدار تغییر

source: Percentage (%)
fa_ir: درصد (%)

source: e.g. 10
fa_ir: مثلاً 10

source: Fixed Amount
fa_ir: عدد ثابت

source: e.g. 5000
fa_ir: مثلاً 5000

source: Only one
fa_ir: فقط یکی

source: of the two fields above should be filled. If both are filled, no changes will be applied.
fa_ir: از دو فیلد بالا را پر کنید. اگر هر دو پر شوند، هیچ تغییری اعمال نخواهد شد.

source: Advanced Settings
fa_ir: تنظیمات پیشرفته

source: Product Filter:
fa_ir: فیلتر محصولات:

source: Process only products currently on sale
fa_ir: فقط محصولات تخفیف‌دار فعلی را پردازش کن

source: Sync Sale Price:
fa_ir: همگام‌سازی قیمت حراج:

source: When changing regular price, also change sale price proportionally
fa_ir: در تغییر قیمت اصلی، قیمت حراج هم به همان نسبت تغییر کند

source: With this option enabled, the discount percentage stays constant and the sale price changes accordingly.
fa_ir: با فعال بودن این گزینه، درصد تخفیف ثابت باقی می‌ماند و قیمت حراج متناسب تغییر می‌کند.

source: Example: If discount was 20%, it will remain 20% after the regular price change.
fa_ir: مثال: اگر تخفیف 20% بود، بعد از تغییر قیمت اصلی همچنان 20% باقی می‌ماند.

source: Category
fa_ir: دسته‌بندی

source: All Categories
fa_ir: همه دسته‌ها

source: Sale Start Date
fa_ir: تاریخ شروع حراج

source: For 'Apply Sale Price' operation, you can set a start date
fa_ir: برای عملیات "اعمال قیمت حراج" می‌توانید تاریخ شروع تعیین کنید

source: Sale End Date
fa_ir: تاریخ پایان حراج

source: For 'Apply Sale Price' operation, you can set an expiry date
fa_ir: برای عملیات "اعمال قیمت حراج" می‌توانید تاریخ انقضا تعیین کنید

source: Image
fa_ir: تصویر

source: Product Name
fa_ir: نام محصول

source: Status
fa_ir: وضعیت

source: Regular Price
fa_ir: قیمت اصلی

source: (Before → After)
fa_ir: (قبل ← بعد)

source: Sale Price
fa_ir: قیمت حراج

source: Discount %
fa_ir: درصد تخفیف

source: Start Date
fa_ir: تاریخ شروع

source: End Date
fa_ir: تاریخ پایان

source: Price Difference
fa_ir: اختلاف قیمت

source: Final Price
fa_ir: قیمت نهایی

source: On Sale
fa_ir: تخفیف‌دار

source: Regular
fa_ir: عادی

source: Removed
fa_ir: حذف شد

source: Remove from list
fa_ir: حذف از لیست

source: None
fa_ir: ندارد

source: Bulk Price Editor
fa_ir: ویرایش قیمت هوشمند

source: Translation Test
fa_ir: تست ترجمه

source: Preview Changes
fa_ir: پیش‌نمایش تغییرات

source: Operation:
fa_ir: عملیات:

source: Change Amount:
fa_ir: مقدار تغییر:

source: Total Products:
fa_ir: تعداد محصولات:

source: Sync:
fa_ir: همگام‌سازی:

source: Enabled
fa_ir: فعال

source: Disabled
fa_ir: غیرفعال

source: Warning: Irreversible Operation
fa_ir: توجه: عملیات برگشت‌ناپذیر

source: By clicking the button below, changes will be %1$spermanently%2$s applied to %3$s%4$d products%5$s.
fa_ir: با کلیک روی دکمه زیر، تغییرات به صورت %1$sدائمی%2$s روی %3$s%4$d محصول%5$s اعمال خواهد شد.

source: No products found or invalid input
fa_ir: محصولی یافت نشد یا ورودی نامعتبر است

source: Please check the following:
fa_ir: لطفاً موارد زیر را بررسی کنید:

source: Only one of "Percentage" or "Fixed Amount" fields should be filled
fa_ir: فقط یکی از فیلدهای "درصد" یا "عدد ثابت" پر شده باشد

source: Products exist with your selected filters
fa_ir: محصولاتی با فیلترهای انتخابی شما وجود داشته باشند

source: Input value is greater than zero
fa_ir: مقدار ورودی بزرگتر از صفر باشد

source: Confirm and Apply
fa_ir: تایید و اجرای نهایی

source: Loading preview page
fa_ir: درحال دریافت پیش‌نمایش صفحه

source: Processing...
fa_ir: در حال پردازش...

source: ⏳ Applying batch
fa_ir: ⏳ درحال اعمال دسته

source: Are you sure you want to apply changes to all products?
fa_ir: آیا از اعمال تغییرات روی تمام محصولات مطمئن هستید؟

source: ✅ Changes successfully applied to all products. Please refresh the page.
fa_ir: ✅ تغییرات با موفقیت روی تمام محصولات اعمال شد. صفحه را رفرش کنید.

source: Error connecting to server
fa_ir: خطا در برقراری ارتباط با سرور

source: Error applying changes
fa_ir: خطا در اعمال تغییرات
